{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "ae37f440",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: lorem-text in /opt/homebrew/lib/python3.11/site-packages (2.1)\n",
      "Requirement already satisfied: Click>=7.0 in /opt/homebrew/lib/python3.11/site-packages (from lorem-text) (8.1.3)\n"
     ]
    }
   ],
   "source": [
    "# Dependencies and imports\n",
    "!pip install lorem-text\n",
    "\n",
    "from lorem_text import lorem\n",
    "from yfiles_jupyter_graphs import GraphWidget"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 177,
   "id": "caedb93c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to DB\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "URI = \"neo4j+s://89698250.databases.neo4j.io\"\n",
    "AUTH = (\"neo4j\", \"nN4v9Y33RjQtEPzqgNAUUbKQj6Os9Hbs_AuGSY7s1DQ\")\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 186,
   "id": "d7bff6bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Clear the DB\n",
    "records, summary, keys = driver.execute_query(\n",
    "    \"MATCH (n) DETACH DELETE (n);\",\n",
    "    database_=\"neo4j\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "id": "489127f0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set unique constraints\n",
    "\n",
    "queries = []\n",
    "\n",
    "queries.append('CREATE CONSTRAINT s_name_unique IF NOT EXISTS FOR (n:Supplier) REQUIRE n.name IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT s_sku_unique IF NOT EXISTS FOR (n:Assembly) REQUIRE n.sku IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT b_sku_unique IF NOT EXISTS FOR (n:Product) REQUIRE n.sku IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT p_sku_unique IF NOT EXISTS FOR (n:Part) REQUIRE n.sku IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT d_sku_version_unique IF NOT EXISTS FOR (n:Description) REQUIRE (n.sku, n.version) IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT s_sku_version_unique IF NOT EXISTS FOR (n:Specification) REQUIRE (n.sku, n.version) IS UNIQUE;')\n",
    "\n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 152,
   "id": "b48036bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create the Suppliers\n",
    "\n",
    "suppliers = [\n",
    "    {'code': 'FR001', 'name': 'XYZ Co (self)', 'country': \"FR\"},\n",
    "    {'code': 'FR002', 'name': 'Supplier #1', 'country': \"FR\"},\n",
    "    {'code': 'CN001', 'name': 'Supplier #2', 'country': \"CN\"},\n",
    "    {'code': 'US001', 'name': 'Supplier #3', 'country': \"US\"},\n",
    "    {'code': 'UK001', 'name': 'Supplier #4', 'country': \"UK\"},\n",
    "]\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "WITH $json as data\n",
    "UNWIND data AS s \n",
    "MERGE (supplier:Supplier {code:s.code}) SET\n",
    "\tsupplier.name = s.name, \n",
    "\tsupplier.country = s.country\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(cypher_query, json = suppliers)\n",
    "\n",
    "\n",
    "print(\"Done\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "e3d25d26",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Parts and supplier relationships\n",
    "queries = []\n",
    "\n",
    "parts = [\n",
    "    # Spokes\n",
    "    {'sku': 'sp01', 'name': 'Spoke - STD', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 100},\n",
    "            {'code': 'FR002', 'cost': 110},\n",
    "            {'code': 'US001', 'cost': 120},\n",
    "    ]},\n",
    "    {'sku': 'sp02', 'name': 'Spoke - FR', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 115},\n",
    "    ]},\n",
    "    {'sku': 'sp03', 'name': 'Spoke - XS', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 90},\n",
    "            {'code': 'FR002', 'cost': 100},\n",
    "            {'code': 'US001', 'cost': 110},\n",
    "    ]},\n",
    "\n",
    "    # Hubs\n",
    "    {'sku': 'hb01', 'name': 'Hub', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'hb02', 'name': 'Hub - SM', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 65},\n",
    "            {'code': 'FR002', 'cost': 90},\n",
    "            {'code': 'US001', 'cost': 93},\n",
    "    ]},\n",
    "    {'sku': 'hb03', 'name': 'Hub - GF', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 40},\n",
    "            {'code': 'FR002', 'cost': 70},\n",
    "            {'code': 'US001', 'cost': 69},\n",
    "    ]},\n",
    "    {'sku': 'hb04', 'name': 'Hub - KL', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 140},\n",
    "            {'code': 'US001', 'cost': 119},\n",
    "    ]},\n",
    "\n",
    "    # Rims\n",
    "    {'sku': 'rm01', 'name': 'Rim - STD', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 600},\n",
    "            {'code': 'US001', 'cost': 510},\n",
    "    ]},\n",
    "    {'sku': 'rm02', 'name': 'Rim - XT', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 620},\n",
    "            {'code': 'US001', 'cost': 530},\n",
    "    ]},\n",
    "    {'sku': 'rm03', 'name': 'Rim - XR', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 590},\n",
    "            {'code': 'US001', 'cost': 505},\n",
    "    ]},\n",
    "\n",
    "    # Tires\n",
    "    {'sku': 'ty01', 'name': 'Tire - STD', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 568},\n",
    "            {'code': 'CN001', 'cost': 320},\n",
    "            {'code': 'US001', 'cost': 700},\n",
    "    ]},\n",
    "    {'sku': 'ty02', 'name': 'Tire - MB', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 560},\n",
    "            {'code': 'US001', 'cost': 710},\n",
    "    ]},\n",
    "    {'sku': 'ty03', 'name': 'Tire - ST', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 325},\n",
    "            {'code': 'US001', 'cost': 705},\n",
    "    ]},\n",
    "\n",
    "    # Valves\n",
    "    {'sku': 'vlv01', 'name': 'Valve', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 42},\n",
    "            {'code': 'CN001', 'cost': 25},\n",
    "            {'code': 'US001', 'cost': 32},\n",
    "    ]},\n",
    "    {'sku': 'hbr01', 'name': 'Handlebar', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 234},\n",
    "    ]},\n",
    "    {'sku': 'hdg01', 'name': 'Handlebar grip', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 121},\n",
    "            {'code': 'FR002', 'cost': 234},\n",
    "            {'code': 'US001', 'cost': 210},\n",
    "    ]},\n",
    "    {'sku': 'fb01', 'name': 'Front brake', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 451},\n",
    "            {'code': 'US001', 'cost': 612},\n",
    "    ]},\n",
    "    {'sku': 'fo01', 'name': 'Fork', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 213},\n",
    "            {'code': 'FR001', 'cost': 250},\n",
    "            {'code': 'FR002', 'cost': 300},\n",
    "            {'code': 'US001', 'cost': 320},\n",
    "    ]},\n",
    "    {'sku': 'sh01', 'name': 'Shifter', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 221},\n",
    "            {'code': 'US001', 'cost': 240},\n",
    "    ]},\n",
    "    {'sku': 's01', 'name': 'Saddle', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 111},\n",
    "            {'code': 'UK001', 'cost': 125},\n",
    "    ]},\n",
    "    {'sku': 'se02', 'name': 'Seat post', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 222},\n",
    "            {'code': 'US001', 'cost': 300},\n",
    "    ]},\n",
    "\n",
    "    # Transmission\n",
    "    {'sku': 'fd01', 'name': 'Front Derailleur', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'US001', 'cost': 451},\n",
    "    ]},\n",
    "\n",
    "    {'sku': 'ch01', 'name': 'Chain', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 234},\n",
    "    ]},\n",
    "    {'sku': 'cr01', 'name': 'Chain Rings', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'FR002', 'cost': 60},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'fr01', 'name': 'Frame', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 212},\n",
    "            {'code': 'FR001', 'cost': 250},\n",
    "            {'code': 'FR002', 'cost': 300},\n",
    "            {'code': 'US001', 'cost': 320},\n",
    "    ]},\n",
    "    {'sku': 'rb01', 'name': 'Rear brakes', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'cs01', 'name': 'Cog set', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 261},\n",
    "            {'code': 'US001', 'cost': 211},\n",
    "    ]},\n",
    "    {'sku': 'rd01', 'name': 'Rear Derailluer', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 340},\n",
    "            {'code': 'US001', 'cost': 432},\n",
    "    ]},\n",
    "    {'sku': 'pd01', 'name': 'Pedal', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'FR002', 'cost': 80},\n",
    "            {'code': 'US001', 'cost': 62},\n",
    "    ]},\n",
    "    {'sku': 'ca01', 'name': 'Crank Arm', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'FR001', 'cost': 120},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'drk_grn', 'name': 'Green', 'uom': 'm2', 'suppliers': [\n",
    "            {'code': 'FR001', 'cost': 100},\n",
    "    ]},\n",
    "    {'sku': 'st01', 'name': 'Stem', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR001', 'cost': 400},\n",
    "    ]},\n",
    "    {'sku': 'hd01', 'name': 'Head', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 500},\n",
    "            {'code': 'US001', 'cost': 550},\n",
    "    ]},\n",
    "\n",
    "]\n",
    "\n",
    "for part in parts:\n",
    "    sku = part['sku']\n",
    "    name = part['name']\n",
    "    uom = part['uom']\n",
    "    \n",
    "    query = f\"CREATE (:Part {{sku: '{sku}', name: '{name}', uom: '{uom}'}})\"\n",
    "    queries.append(query)\n",
    "    \n",
    "#     # Part Description\n",
    "#     query = f\"CREATE (:Description {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "#     queries.append(query)\n",
    "#     query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (p)-[:IS_DESCRIBED_BY]->(d)\"\n",
    "#     queries.append(query)\n",
    "# #     query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (d)-[:DESCRIBES]->(p)\"\n",
    "# #     queries.append(query)\n",
    "\n",
    "#     # Part Specification\n",
    "#     query = f\"CREATE (:Specification {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "#     queries.append(query)\n",
    "#     query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (p)-[:IS_SPECIFIED_BY]->(d)\"\n",
    "#     queries.append(query)\n",
    "# #     query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (d)-[:SPECIFIES]->(p)\"\n",
    "# #     queries.append(query)\n",
    "\n",
    "    counter = 0\n",
    "    for supplier in part['suppliers']:\n",
    "        supplier_code = supplier['code']\n",
    "        supplier_cost = supplier['cost']\n",
    "        \n",
    "\t# Supplier\n",
    "        part_supplier_query = f\"MATCH (p:Part {{sku: '{sku}'}}), (s:Supplier {{code: '{supplier_code}'}}) CREATE (p)-[:IS_SOURCED_FROM {{cost: {supplier_cost}}}]->(s)\"\n",
    "        queries.append(part_supplier_query)\n",
    "        # supplier_part_query = f\"MATCH (p:Part {{sku: '{sku}'}}), (s:Supplier {{code: '{supplier_code}'}}) CREATE (s)-[:SUPPLIES {{cost: {supplier_cost}}}]->(p)\"\n",
    "        # queries.append(supplier_part_query)\n",
    "\n",
    "\t# Selected Supplier / Winning Supplier / Contracted Supplier\n",
    "        if counter == 0:\n",
    "            selected_supplier_query = f\"MATCH (p:Part {{sku: '{sku}'}}), (s:Supplier {{code: '{supplier_code}'}}) CREATE (p)-[:SELECTED {{cost: {supplier_cost}}}]->(s)\"\n",
    "            queries.append(selected_supplier_query)\n",
    "\n",
    "        counter +=1\n",
    "        \n",
    "\n",
    "\n",
    "# Print the queries\n",
    "# for query in queries:\n",
    "#     print(query)\n",
    "    \n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "63ee6e95",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Product(s) and relationships\n",
    "queries = []\n",
    "\n",
    "products = [\n",
    "    {\n",
    "        \"sku\": \"ss01\",\n",
    "        \"name\": \"SuperSport\",\n",
    "        \"retail_price\": 29999,\n",
    "        \"assemblies\": [\n",
    "            {'sku': 'co01', 'name': 'Color', 'parts': [\n",
    "                {'sku':'drk_grn','qty':2, 'order': 1},\n",
    "                ],'qty':1, 'order':99},\n",
    "            {'sku': 'whl01', 'name': 'Wheel Assembly', 'parts': [\n",
    "                {'sku':'sp01','qty':21, 'order': 2},\n",
    "                {'sku':'hb01','qty':1, 'order': 1},\n",
    "                {'sku':'rm01','qty':1, 'order': 3},\n",
    "                {'sku':'ty01','qty':1, 'order': 5},\n",
    "                {'sku':'vlv01','qty':1, 'order': 4},\n",
    "                ],'qty':2, 'assemblies': [\n",
    "                    {'sku': 'co01'}\n",
    "                ], 'order':1, 'alternative_parts': [\n",
    "                    {'sku': 'rm02'},\n",
    "\t\t\t\t\t{'sku': 'rm03'},\n",
    "\t\t\t\t\t{'sku': 'rm04'},\n",
    "\t\t\t\t\t{'sku': 'ty02'},\n",
    "\t\t\t\t\t{'sku': 'ty03'},\n",
    "\t\t\t\t\t{'sku': 'ty04'},\n",
    "                ]},\n",
    "            {'sku': 'fs01', 'name': 'Front Set', 'parts': [\n",
    "                {'sku':'hbr01','qty':1, 'order': 1},\n",
    "                {'sku':'hdg01','qty':2, 'order': 2},\n",
    "                {'sku':'fb01','qty':1, 'order': 3},\n",
    "                {'sku':'fo01','qty':1, 'order': 5},\n",
    "                {'sku':'sh01','qty':1, 'order': 4},\n",
    "                ],'qty':1, 'assemblies': [\n",
    "                    {'sku': 'co01'}\n",
    "                ], 'order':3},\n",
    "            {'sku': 'sa01', 'name': 'Saddle Area', 'parts': [\n",
    "                {'sku':'s01','qty':1, 'order': 2},\n",
    "                {'sku':'se02','qty':1, 'order': 1},\n",
    "                ],'qty':1, 'order':2},\n",
    "            {'sku': 'tr01', 'name': 'Transmission', 'parts': [\n",
    "                {'sku':'fd01','qty':1, 'order': 2},\n",
    "                {'sku':'ch01','qty':1, 'order': 1},\n",
    "                {'sku':'cr01','qty':1, 'order': 3},\n",
    "                {'sku':'rb01','qty':1, 'order': 4},\n",
    "                {'sku':'cs01','qty':1, 'order': 5},\n",
    "                {'sku':'rd01','qty':1, 'order': 6},\n",
    "                {'sku':'rca01','qty':2, 'order': 7},\n",
    "                {'sku':'pd01','qty':2, 'order': 8},\n",
    "                ],'qty':1, 'order':5},\n",
    "            {'sku': 'fr01', 'name': 'Frame', 'parts': [\n",
    "                {'sku':'fr01','qty':1, 'order': 1},\n",
    "                {'sku':'st01','qty':1, 'order': 2},\n",
    "                {'sku':'hd01','qty':1, 'order': 3},\n",
    "                ],'qty':1, 'assemblies': [\n",
    "                    {'sku': 'co01'}\n",
    "                ], 'order':4},\n",
    "        ],\n",
    "    }\n",
    "]\n",
    "\n",
    "for product in products:\n",
    "    sku = product['sku']\n",
    "    name = product['name']\n",
    "    retail_price = product['retail_price']\n",
    "\n",
    "    # Create Product\n",
    "    product_query = f\"CREATE (:Product {{sku: '{sku}', name: '{name}', retail_price: {retail_price}}})\"\n",
    "    queries.append(product_query)\n",
    "    \n",
    "    # Product Description\n",
    "    query = f\"CREATE (:Description {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "    queries.append(query)\n",
    "    query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (p)-[:IS_DESCRIBED_BY]->(d)\"\n",
    "    queries.append(query)\n",
    "    # query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (d)-[:DESCRIBES]->(p)\"\n",
    "    # queries.append(query)\n",
    "\n",
    "    # Product Specification\n",
    "    query = f\"CREATE (:Specification {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "    queries.append(query)\n",
    "    query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (p)-[:IS_SPECIFIED_BY]->(d)\"\n",
    "    queries.append(query)\n",
    "    # query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (d)-[:SPECIFIES]->(p)\"\n",
    "    # queries.append(query)\n",
    "    \n",
    "    for assembly in product['assemblies']:\n",
    "        assembly_sku = assembly['sku']\n",
    "        assembly_name = assembly['name']\n",
    "        assembly_order = assembly['order']\n",
    "        assembly_qty = assembly['qty']\n",
    "        \n",
    "        assembly_query = f\"CREATE (:Assembly {{sku: '{assembly_sku}', name: '{assembly_name}', order: {assembly_order}}})\"\n",
    "        queries.append(assembly_query)\n",
    "        \n",
    "        # Product Assembly\n",
    "        # assembly_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Product {{sku: '{sku}'}}) CREATE (a)-[:BELONGS_TO {{qty: {qty}, order: {order}}}]->(p)\"\n",
    "        # queries.append(assembly_part_query)\n",
    "        part_assembly_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Product {{sku: '{sku}'}}) CREATE (p)-[:HAS {{order: {assembly_order}, qty: {assembly_qty}}}]->(a)\"\n",
    "        queries.append(part_assembly_query)\n",
    "        \n",
    "        if 'parts' in assembly:\n",
    "            for part in assembly['parts']:\n",
    "                part_sku = part['sku']\n",
    "                qty = part['qty']\n",
    "                order = part['order']\n",
    "                \n",
    "                # Part Assembly\n",
    "                assembly_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Part {{sku: '{part_sku}'}}) CREATE (a)-[:HAS {{qty: {qty}, order: {order}}}]->(p)\"\n",
    "                queries.append(assembly_part_query)\n",
    "                # part_assembly_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Part {{sku: '{part_sku}'}}) CREATE (p)-[:BELONGS_TO {{qty: {qty}, order: {order}}}]->(a)\"\n",
    "                # queries.append(part_assembly_query)\n",
    "                \n",
    "        if 'assemblies' in assembly:\n",
    "            for a in assembly['assemblies']:\n",
    "                a_sku = a['sku']\n",
    "                        \n",
    "                assembly_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (b:Assembly {{sku: '{a_sku}'}}) CREATE (a)-[:HAS]->(b)\"\n",
    "                queries.append(assembly_part_query)\n",
    "\n",
    "        if 'alternative_parts' in assembly:\n",
    "            # print(\"here\")\n",
    "            for a in assembly['alternative_parts']:\n",
    "                # print(a)\n",
    "                alternative_part_sku = a['sku']\n",
    "                        \n",
    "                alternative_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Part {{sku: '{alternative_part_sku}'}}) CREATE (a)-[:COULD_HAVE]->(p)\"\n",
    "                queries.append(alternative_part_query)\n",
    "\n",
    "\n",
    "\n",
    "# # Print the queries\n",
    "# for query in queries:\n",
    "#     print(query)\n",
    "\n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 155,
   "id": "f91f252d-0b83-416b-aae8-8205980c47d0",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Query DB for all nodes and all relationships\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "  graph = session.run(\"MATCH p=()-[]->() RETURN p;\").graph()\n",
    "\n",
    "# graph\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "id": "7b33b0b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# custom graph functions\n",
    "\n",
    "def custom_node_color_mapping(index: int, node: dict):\n",
    "    # print(node)\n",
    "    if node[\"properties\"][\"label\"] == \"Part\":\n",
    "        return \"green\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Product\":\n",
    "        return \"red\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Assembly\":\n",
    "        return \"orange\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Specification\":\n",
    "        return \"blue\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Description\":\n",
    "        return \"cyan\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Supplier\":\n",
    "        return \"pink\"\n",
    "    \n",
    "def custom_node_label_mapping(index: int, node: dict):\n",
    "    # print(node)\n",
    "    if node[\"properties\"][\"label\"] == \"Part\":\n",
    "        return node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Product\":\n",
    "        return node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Assembly\":\n",
    "        return node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Specification\":\n",
    "        return \"v: \" + node[\"properties\"][\"version\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Description\":\n",
    "        return \"v: \" + node[\"properties\"][\"version\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Supplier\":\n",
    "        return node[\"properties\"][\"name\"] + \" - \" + node[\"properties\"][\"country\"]\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "0990f7e0",
   "metadata": {},
   "source": [
    "# TODO\n",
    "\n",
    " - set weight of node based attribute, eg cost [Problem: cost lives on the relationship, not the node]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "id": "1585483e-33f0-4eb5-8867-a61db6f8728c",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "99b14deeadd4467fa618dd62dfbba0c8",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Render ALL graph...\n",
    "\n",
    "w = GraphWidget(graph=graph)\n",
    "w.directed = False\n",
    "w.set_graph_layout(\"orthogonal\")\n",
    "w.set_neighborhood(1,[graph.nodes.get(0).element_id])\n",
    "w.set_sidebar(enabled = False, start_with = \"Neighbourhood\")\n",
    "w.set_overview(False)\n",
    "\n",
    "w.set_node_color_mapping(custom_node_color_mapping)\n",
    "# w.set_node_color_mapping(lambda index, node : \"blue\" if node[\"properties\"][\"label\"] == \"Part\" else (\"orange\" if node[\"properties\"][\"label\"] == \"SubAssembly\" else \"red\"))\n",
    "w.set_edge_color_mapping(lambda index, edge : \"orange\")\n",
    "# w.set_node_label_mapping(lambda index, node : node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"])\n",
    "w.set_node_label_mapping(custom_node_label_mapping)\n",
    "# w.set_node_scale_factor_mapping(lambda index,node: node[\"properties\"][\"cost\"] / 1000 if node[\"properties\"][\"label\"] == \"Part\" else 1)\n",
    "\n",
    "w.show()\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "c39eb52b",
   "metadata": {},
   "source": [
    "# Product Cost\n",
    "\n",
    "(Product) -> [Has] -> (Part) -> [Selected] -> (Supplier)\n",
    "\n",
    "To find the product cost, we have to establish the\n",
    "\n",
    " - the parts that make up the product\n",
    " - the SELECTED suppliers\n",
    " - get the qty from both product->HAS->part and assembly->HAS->part relationships\n",
    " - get the cost on the SELECTED relationship\n",
    " - total the qty * cost\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 166,
   "id": "3a95008b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total Cost for the Product [ss01]: $112.72\n"
     ]
    }
   ],
   "source": [
    "# Calculate Bike Cost\n",
    "\n",
    "## Cost is on the (Part)-[SELECTED]->(Supplier)\n",
    "## MATCH (p:Part)-[r:SELECTED]->(s:Supplier) RETURN SUM(r.cost) AS totalSum\n",
    "\n",
    "cost = 0\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(\"MATCH(product:Product)-[h1:HAS]-(ass:Assembly)-[h2:HAS]-(part:Part)-[s:SELECTED]-(supplier:Supplier) WHERE product.sku = 'ss01' return product.sku as sku, h1.qty as a_qty, h2.qty as p_qty, sum(s.cost) as cost;\")\n",
    "    # record = result.single()  # Assuming the query returns a single record\n",
    "\n",
    "    for record in result.data():\n",
    "        sku = record[\"sku\"]\n",
    "        cost += (record[\"a_qty\"] * record[\"p_qty\"] * record[\"cost\"])\n",
    "\n",
    "    print(\"Total Cost for the Product [\" + sku + \"]:\", f\"${cost/100:,.2f}\")\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "id": "83084dd7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "474f847d50a64f29a9f99f6d2176cb2a",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Show Supplier Cloud\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "  graph = session.run(\"MATCH (p:Part)-[r:SELECTED]->(s:Supplier) RETURN p,r,s\").graph()\n",
    "\n",
    "w = GraphWidget(graph=graph)\n",
    "w.directed = False\n",
    "w.set_graph_layout(\"radial\")\n",
    "# w.set_neighborhood(1,[graph.nodes.get(0).element_id])\n",
    "w.set_sidebar(enabled = False, start_with = \"Neighbourhood\")\n",
    "w.set_overview(False)\n",
    "\n",
    "w.set_node_color_mapping(custom_node_color_mapping)\n",
    "# w.set_node_color_mapping(lambda index, node : \"blue\" if node[\"properties\"][\"label\"] == \"Part\" else (\"orange\" if node[\"properties\"][\"label\"] == \"SubAssembly\" else \"red\"))\n",
    "w.set_edge_color_mapping(lambda index, edge : \"orange\")\n",
    "# w.set_node_label_mapping(lambda index, node : node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"])\n",
    "w.set_node_label_mapping(custom_node_label_mapping)\n",
    "# w.set_node_scale_factor_mapping(lambda index,node: node[\"properties\"][\"cost\"] / 1000 if node[\"properties\"][\"label\"] == \"Part\" else 1)\n",
    "\n",
    "w.show()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "id": "f5f1411b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "        SKU              Part  A_Qty  P_Qty  Total\n",
      "0      ch01             Chain      1      1      1\n",
      "1      cr01       Chain Rings      1      1      1\n",
      "2      cs01           Cog set      1      1      1\n",
      "3      fo01              Fork      1      1      1\n",
      "4      fr01             Frame      1      1      1\n",
      "5      fd01  Front Derailleur      1      1      1\n",
      "6      fb01       Front brake      1      1      1\n",
      "7   drk_grn             Green      1      2      2\n",
      "8     hbr01         Handlebar      1      1      1\n",
      "9     hdg01    Handlebar grip      1      2      2\n",
      "10     hd01              Head      1      1      1\n",
      "11     hb01               Hub      2      1      2\n",
      "12     pd01             Pedal      1      2      2\n",
      "13     rd01   Rear Derailluer      1      1      1\n",
      "14     rb01       Rear brakes      1      1      1\n",
      "15     rm01         Rim - STD      2      1      2\n",
      "16      s01            Saddle      1      1      1\n",
      "17     se02         Seat post      1      1      1\n",
      "18     sh01           Shifter      1      1      1\n",
      "19     sp01       Spoke - STD      2     21     42\n",
      "20     st01              Stem      1      1      1\n",
      "21     ty01        Tire - STD      2      1      2\n",
      "22    vlv01             Valve      2      1      2\n"
     ]
    }
   ],
   "source": [
    "# Show eBOM\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "MATCH (product:Product)-[h1:HAS]-(assembly:Assembly)-[h2:HAS]-(part:Part)\n",
    "WHERE product.sku = 'ss01'\n",
    "RETURN part.sku as SKU, part.name AS Part, h1.qty as A_Qty, h2.qty as P_Qty\n",
    "ORDER BY part.name\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(cypher_query)\n",
    "    df = pd.DataFrame(result.data(), columns=result.keys())\n",
    "    \n",
    "df[\"Total\"] = df[\"A_Qty\"] * df[\"P_Qty\"]\n",
    "\n",
    "# Print the DataFrame as a table\n",
    "print(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "id": "f06d036c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    a_order        assembly  p_order              part  A_Qty  P_Qty  cost  \\\n",
      "0         1  Wheel Assembly        1               Hub      2      1    60   \n",
      "1         1  Wheel Assembly        2       Spoke - STD      2     21   100   \n",
      "2         1  Wheel Assembly        3         Rim - STD      2      1   600   \n",
      "3         1  Wheel Assembly        4             Valve      2      1    42   \n",
      "4         1  Wheel Assembly        5        Tire - STD      2      1   568   \n",
      "5         2     Saddle Area        1         Seat post      1      1   222   \n",
      "6         2     Saddle Area        2            Saddle      1      1   111   \n",
      "7         3       Front Set        1         Handlebar      1      1   234   \n",
      "8         3       Front Set        2    Handlebar grip      1      2   121   \n",
      "9         3       Front Set        3       Front brake      1      1   451   \n",
      "10        3       Front Set        4           Shifter      1      1   221   \n",
      "11        3       Front Set        5              Fork      1      1   213   \n",
      "12        4           Frame        1             Frame      1      1   212   \n",
      "13        4           Frame        2              Stem      1      1   400   \n",
      "14        4           Frame        3              Head      1      1   500   \n",
      "15        5    Transmission        1             Chain      1      1   234   \n",
      "16        5    Transmission        2  Front Derailleur      1      1   451   \n",
      "17        5    Transmission        3       Chain Rings      1      1    60   \n",
      "18        5    Transmission        4       Rear brakes      1      1    60   \n",
      "19        5    Transmission        5           Cog set      1      1   261   \n",
      "20        5    Transmission        6   Rear Derailluer      1      1   340   \n",
      "21        5    Transmission        8             Pedal      1      2    60   \n",
      "22       99           Color        1             Green      1      2   100   \n",
      "\n",
      "    total  \n",
      "0     120  \n",
      "1    4200  \n",
      "2    1200  \n",
      "3      84  \n",
      "4    1136  \n",
      "5     222  \n",
      "6     111  \n",
      "7     234  \n",
      "8     242  \n",
      "9     451  \n",
      "10    221  \n",
      "11    213  \n",
      "12    212  \n",
      "13    400  \n",
      "14    500  \n",
      "15    234  \n",
      "16    451  \n",
      "17     60  \n",
      "18     60  \n",
      "19    261  \n",
      "20    340  \n",
      "21    120  \n",
      "22    200  \n",
      "\n",
      "\n",
      "11272\n",
      "Total Cost for the Product [ss01]: $112.72\n"
     ]
    }
   ],
   "source": [
    "# Show mBOM\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "MATCH (product:Product)-[h1:HAS]-(assembly:Assembly)-[h2:HAS]-(part:Part)-[s:SELECTED]-(supplier:Supplier)\n",
    "WHERE product.sku = 'ss01'\n",
    "RETURN assembly.order AS a_order, assembly.name AS assembly, \n",
    "       h2.order AS p_order, part.name AS part, h2.qty as Qty, supplier.name AS supplier, s.cost as cost\n",
    "ORDER BY assembly.order, h2.order\n",
    "\"\"\"\n",
    "\n",
    "cypher_query = \"\"\"\n",
    "MATCH (product:Product)-[h1:HAS]-(assembly:Assembly)-[h2:HAS]-(part:Part)-[s:SELECTED]-(supplier:Supplier)\n",
    "WHERE product.sku = 'ss01'\n",
    "RETURN assembly.order AS a_order, assembly.name AS assembly, \n",
    "       h2.order AS p_order, part.name AS part, h1.qty as A_Qty, h2.qty as P_Qty, s.cost as cost\n",
    "ORDER BY assembly.order, h2.order\n",
    "\"\"\"\n",
    "\n",
    "with driver.session() as session:\n",
    "    result = session.run(cypher_query)\n",
    "    df = pd.DataFrame(result.data(), columns=result.keys())\n",
    "    \n",
    "df[\"total\"] = df[\"A_Qty\"] * df[\"P_Qty\"] * df[\"cost\"]\n",
    "\n",
    "# Print the DataFrame as a table\n",
    "print(df)\n",
    "\n",
    "print()\n",
    "print()\n",
    "\n",
    "total = df['total'].sum()\n",
    "print(total)\n",
    "print(\"Total Cost for the Product [\" + sku + \"]:\", f\"${total/100:,.2f}\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
