{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "id": "9d9b7348",
   "metadata": {},
   "source": [
    "# BOM\n",
    "\n",
    "```\n",
    "Bicycle\n",
    "\tWheel\n",
    "\t\tSpokes\n",
    "\t\tHub\n",
    "\t\tRim\n",
    "\t\t\tColor\n",
    "\t\tTire\n",
    "\t\tValve\n",
    "\tFront Set\n",
    "\t\tHandlebar grip\n",
    "\t\tFront brake\n",
    "\t\tFork\n",
    "\t\t\tColor\n",
    "\t\tShifter\n",
    "\tSaddle Area\n",
    "\t\tSaddle\n",
    "\t\tSeat post\n",
    "\tTransmission\n",
    "\t\tChain\n",
    "\t\tChain Rings\n",
    "\t\tRear brakes\n",
    "\t\tCog set\n",
    "\t\tRear Derailluer\n",
    "\t\tFront Derailleur\n",
    "\t\tPedal\n",
    "\t\tCrank Arm\n",
    "\tFrame\n",
    "\t\tFrame\n",
    "\t\tStem\n",
    "\t\tHead\n",
    "\t\t\tColor\n",
    "```\n",
    "\n",
    "\n",
    "## Relationships\n",
    "\n",
    "\n",
    "\n",
    "### Supplier\n",
    " - Supplier supplies Part\n",
    " - Supplier supplies Assembly\n",
    "\n",
    "\n",
    "### Person\n",
    " - Person assembles Part\n",
    " - Person assembles Assembly\n",
    "\n",
    "\n",
    "### Assembly\n",
    " - Assembly is sourced from Supplier\n",
    " - Assembly belongs to Product\n",
    " - Assembly has Part\n",
    " - Assembly has Assembly\n",
    " - Assembly is assembled by Person\n",
    " - Assembly is specified by Specification\n",
    " - Assembly is instructed by Instruction\n",
    "\n",
    "\n",
    "### Part\n",
    " - Part is assembled by Person\n",
    " - Part is sourced from Supplier\n",
    " - Part belongs to Product\n",
    " - Part belongs to Assembly\n",
    " - Part is specified by Specification\n",
    " - Part is instructed by Instruction\n",
    "\n",
    "\n",
    "### Product\n",
    " - Product has Assembly\n",
    " - Product has Part \n",
    " - Product is specified by Specification\n",
    " - Product is instructed by Instruction\n",
    "\n",
    "\n",
    "### Specification\n",
    " - Specification specifies Part\n",
    " - Specification specifies Assembly\n",
    " - Specification specifies Product\n",
    "\n",
    "\n",
    "### Instruction\n",
    " - Instruction instructs Part\n",
    " - Instruction instructs Assembly\n",
    " - Instruction instructs Product\n",
    "\n",
    "\n",
    "## Queries\n",
    "\n",
    "```\n",
    "// Delete all\n",
    "MATCH (n) DETACH DELETE (n);\n",
    "\n",
    "\n",
    "// Bicycle\n",
    "CREATE CONSTRAINT b_sku_unique IF NOT EXISTS FOR (n:Bicycle) REQUIRE n.sku IS UNIQUE;\n",
    "CREATE (b:Bicycle {sku: 'ss01', name: 'SuperSport', retail_price: 29900});\n",
    "\n",
    "\n",
    "// SubAssembly\n",
    "CREATE CONSTRAINT s_sku_unique IF NOT EXISTS FOR (n:SubAssembly) REQUIRE n.sku IS UNIQUE;\n",
    "CREATE (sa:SubAssembly {sku: 'whl01', name: 'Wheel SubAssembly'});\n",
    "CREATE (sa:SubAssembly {sku: 'fs01', name: 'Front Set'});\n",
    "CREATE (sa:SubAssembly {sku: 'sa01', name: 'Saddle Area'});\n",
    "\n",
    "// Parts\n",
    "CREATE CONSTRAINT p_sku_unique IF NOT EXISTS FOR (n:Part) REQUIRE n.sku IS UNIQUE;\n",
    "CREATE (p:Part {sku: 'sp01', name: 'Spoke', cost: 15});\n",
    "CREATE (p:Part {sku: 'hb01', name: 'Hub', cost: 89});\n",
    "CREATE (p:Part {sku: 'rm01', name: 'Rim', cost: 1158});\n",
    "CREATE (p:Part {sku: 'ty01', name: 'Tire', cost: 568});\n",
    "CREATE (p:Part {sku: 'vlv01', name: 'Valve', cost: 451});\n",
    "CREATE (p:Part {sku: 'hdg01', name: 'Handlebar grip', cost: 745});\n",
    "CREATE (p:Part {sku: 'fb01', name: 'Front brake', cost: 451});\n",
    "CREATE (p:Part {sku: 's01', name: 'Saddle', cost: 111});\n",
    "CREATE (p:Part {sku: 'sp02', name: 'Seat post', cost: 222});\n",
    "CREATE (p:Part {sku: 'fd01', name: 'Front Derailleur', cost: 451});\n",
    "CREATE (p:Part {sku: 'ch01', name: 'Chain', cost: 234});\n",
    "CREATE (p:Part {sku: 'cr01', name: 'Chain Rings', cost: 456});\n",
    "CREATE (p:Part {sku: 'fr01', name: 'Frame', cost: 444});\n",
    "CREATE (p:Part {sku: 'rb01', name: 'Rear brakes', cost: 261});\n",
    "CREATE (p:Part {sku: 'cs01', name: 'Cog set', cost: 1256});\n",
    "CREATE (p:Part {sku: 'rd01', name: 'Rear Derailluer', cost: 6432});\n",
    "CREATE (p:Part {sku: 'pd01', name: 'Pedal', cost: 311});\n",
    "\n",
    "\n",
    "// Bike has Sub-assemblies\n",
    "MATCH (b:Bicycle),(sa:SubAssembly) WHERE b.sku = 'ss01' AND sa.sku = 'whl01' CREATE (b)-[:HAS {qty: 2, order: 1}]->(sa);\n",
    "MATCH (b:Bicycle),(sa:SubAssembly) WHERE b.sku = 'ss01' AND sa.sku = 'fs01' CREATE (b)-[:HAS {qty: 1, order: 2}]->(sa);\n",
    "MATCH (b:Bicycle),(sa:SubAssembly) WHERE b.sku = 'ss01' AND sa.sku = 'sa01' CREATE (b)-[:HAS {qty: 1, order: 3}]->(sa);\n",
    "\n",
    "\n",
    "// Sub-assemblies makes up bike\n",
    "MATCH (b:Bicycle),(sa:SubAssembly) WHERE b.sku = 'ss01' AND sa.sku = 'whl01' CREATE (sa)-[:MAKES_UP {qty: 2, order: 1}]->(b);\n",
    "MATCH (b:Bicycle),(sa:SubAssembly) WHERE b.sku = 'ss01' AND sa.sku = 'fs01' CREATE (sa)-[:MAKES_UP {qty: 1, order: 2}]->(b);\n",
    "MATCH (b:Bicycle),(sa:SubAssembly) WHERE b.sku = 'ss01' AND sa.sku = 'sa01' CREATE (sa)-[:MAKES_UP {qty: 1, order: 3}]->(b);\n",
    "\n",
    "\n",
    "// Parts makes up bike\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'hb01' CREATE (p)-[:MAKES_UP {qty: 2, order: 1}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'sp01' CREATE (p)-[:MAKES_UP {qty: 42, order: 2}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'rm01' CREATE (p)-[:MAKES_UP {qty: 2, order: 3}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'vlv01' CREATE (p)-[:MAKES_UP {qty: 2, order: 4}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'ty01' CREATE (p)-[:MAKES_UP {qty: 2, order: 5}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'hdg01' CREATE (p)-[:MAKES_UP {qty: 2, order: 1}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'fb01' CREATE (p)-[:MAKES_UP {qty: 1, order: 2}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 's01' CREATE (p)-[:MAKES_UP {qty: 1, order: 1}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'sp02' CREATE (p)-[:MAKES_UP {qty: 1, order: 2}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'fd01' CREATE (p)-[:MAKES_UP {qty: 1, order: 4}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'ch01' CREATE (p)-[:MAKES_UP {qty: 1, order: 5}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'cr01' CREATE (p)-[:MAKES_UP {qty: 1, order: 6}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'fr01' CREATE (p)-[:MAKES_UP {qty: 1, order: 7}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'rb01' CREATE (p)-[:MAKES_UP {qty: 1, order: 8}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'cs01' CREATE (p)-[:MAKES_UP {qty: 1, order: 9}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'rd01' CREATE (p)-[:MAKES_UP {qty: 1, order: 10}]->(b);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'pd01' CREATE (p)-[:MAKES_UP {qty: 2, order: 11}]->(b);\n",
    "\n",
    "// Bike has Parts\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'hb01' CREATE (b)-[:HAS {qty: 2, order: 1}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'sp01' CREATE (b)-[:HAS {qty: 42, order: 2}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'rm01' CREATE (b)-[:HAS {qty: 2, order: 3}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'vlv01' CREATE (b)-[:HAS {qty: 2, order: 4}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'ty01' CREATE (b)-[:HAS {qty: 2, order: 5}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'hdg01' CREATE (b)-[:HAS {qty: 2, order: 1}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'fb01' CREATE (b)-[:HAS {qty: 1, order: 2}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 's01' CREATE (b)-[:HAS {qty: 11, order: 1}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'sp02' CREATE (b)-[:HAS {qty: 1, order: 2}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'fd01' CREATE (b)-[:HAS {qty: 1, order: 4}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'ch01' CREATE (b)-[:HAS {qty: 1, order: 5}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'cr01' CREATE (b)-[:HAS {qty: 1, order: 6}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'fr01' CREATE (b)-[:HAS {qty: 1, order: 7}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'rb01' CREATE (b)-[:HAS {qty: 1, order: 8}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'cs01' CREATE (b)-[:HAS {qty: 1, order: 9}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'rd01' CREATE (b)-[:HAS {qty: 1, order: 10}]->(p);\n",
    "MATCH (b:Bicycle),(p:Part) WHERE b.sku = 'ss01' AND p.sku = 'pd01' CREATE (b)-[:HAS {qty: 2, order: 11}]->(p);\n",
    "\n",
    "\n",
    "// Parts makes up Sub-assemblies\n",
    "// Wheel\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'hb01' CREATE (p)-[:MAKES_UP {qty: 1, order: 1}]->(sa);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'sp01' CREATE (p)-[:MAKES_UP {qty: 21, order: 2}]->(sa);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'rm01' CREATE (p)-[:MAKES_UP {qty: 1, order: 3}]->(sa);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'vlv01' CREATE (p)-[:MAKES_UP {qty: 1, order: 4}]->(sa);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'ty01' CREATE (p)-[:MAKES_UP {qty: 1, order: 5}]->(sa);\n",
    "// Front Set\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'sa01' AND p.sku = 'hdg01' CREATE (p)-[:MAKES_UP {qty: 2, order: 1}]->(sa);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'sa01' AND p.sku = 'fb01' CREATE (p)-[:MAKES_UP {qty: 1, order: 2}]->(sa);\n",
    "// Saddle Area\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'fs01' AND p.sku = 's01' CREATE (p)-[:MAKES_UP {qty: 11, order: 1}]->(sa);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'fs01' AND p.sku = 'sp02' CREATE (p)-[:MAKES_UP {qty: 1, order: 2}]->(sa);\n",
    "\n",
    "\n",
    "// Sub-assembly has parts\n",
    "// Wheel\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'hb01' CREATE (sa)-[:HAS {qty: 1, order: 1}]->(p);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'sp01' CREATE (sa)-[:HAS {qty: 21, order: 2}]->(p);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'rm01' CREATE (sa)-[:HAS {qty: 1, order: 3}]->(p);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'vlv01' CREATE (sa)-[:HAS {qty: 1, order: 4}]->(p);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'whl01' AND p.sku = 'ty01' CREATE (sa)-[:HAS {qty: 1, order: 5}]->(p);\n",
    "// Front Set\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'sa01' AND p.sku = 'hdg01' CREATE (sa)-[:HAS {qty: 2, order: 1}]->(p);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'sa01' AND p.sku = 'fb01' CREATE (sa)-[:HAS {qty: 1, order: 2}]->(p);\n",
    "// Saddle Area\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'fs01' AND p.sku = 's01' CREATE (sa)-[:HAS {qty: 1, order: 1}]->(p);\n",
    "MATCH (sa:SubAssembly), (p:Part) WHERE sa.sku = 'fs01' AND p.sku = 'sp02' CREATE (sa)-[:HAS {qty: 1, order: 2}]->(p);\n",
    "\n",
    "```\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ae37f440",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: lorem-text in /opt/homebrew/lib/python3.11/site-packages (2.1)\n",
      "Requirement already satisfied: Click>=7.0 in /opt/homebrew/lib/python3.11/site-packages (from lorem-text) (8.1.3)\n"
     ]
    }
   ],
   "source": [
    "!pip install lorem-text"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "7df766fb",
   "metadata": {},
   "outputs": [],
   "source": [
    "from lorem_text import lorem"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "caedb93c",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# URI examples: \"neo4j://localhost\", \"neo4j+s://xxx.databases.neo4j.io\"\n",
    "URI = \"neo4j+s://89698250.databases.neo4j.io\"\n",
    "AUTH = (\"neo4j\", \"nN4v9Y33RjQtEPzqgNAUUbKQj6Os9Hbs_AuGSY7s1DQ\")\n",
    "\n",
    "with GraphDatabase.driver(URI, auth=AUTH) as driver:\n",
    "    driver.verify_connectivity()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "d7bff6bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Clear the DB\n",
    "records, summary, keys = driver.execute_query(\n",
    "    \"MATCH (n) DETACH DELETE (n);\",\n",
    "    database_=\"neo4j\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "489127f0",
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = []\n",
    "\n",
    "# Set unique constraints\n",
    "queries.append('CREATE CONSTRAINT s_name_unique IF NOT EXISTS FOR (n:Supplier) REQUIRE n.name IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT s_sku_unique IF NOT EXISTS FOR (n:Assembly) REQUIRE n.sku IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT b_sku_unique IF NOT EXISTS FOR (n:Product) REQUIRE n.sku IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT p_sku_unique IF NOT EXISTS FOR (n:Part) REQUIRE n.sku IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT d_sku_version_unique IF NOT EXISTS FOR (n:Description) REQUIRE (n.sku, n.version) IS UNIQUE;')\n",
    "queries.append('CREATE CONSTRAINT s_sku_version_unique IF NOT EXISTS FOR (n:Specification) REQUIRE (n.sku, n.version) IS UNIQUE;')\n",
    "\n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "b48036bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Suppliers\n",
    "queries = []\n",
    "\n",
    "suppliers = [\n",
    "    {'code': 'FR001', 'name': 'XYZ Co (self)', 'country': \"FR\"},\n",
    "    {'code': 'FR002', 'name': 'Supplier #1', 'country': \"FR\"},\n",
    "    {'code': 'CN001', 'name': 'Supplier #2', 'country': \"CN\"},\n",
    "    {'code': 'US001', 'name': 'Supplier #3', 'country': \"US\"},\n",
    "    {'code': 'UK001', 'name': 'Supplier #4', 'country': \"UK\"},\n",
    "]\n",
    "\n",
    "# Create Suppliers\n",
    "for supplier in suppliers:\n",
    "    code = supplier['code']\n",
    "    name = supplier['name']\n",
    "    country = supplier['country']\n",
    "    \n",
    "    query = f\"CREATE (:Supplier {{code: '{code}', name: '{name}', country: '{country}'}})\"\n",
    "    queries.append(query)\n",
    "\n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "e3d25d26",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Parts and relationships\n",
    "queries = []\n",
    "\n",
    "parts = [\n",
    "    {'sku': 'sp01', 'name': 'Spoke', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 100, 'selected': True},\n",
    "            {'code': 'FR002', 'cost': 110},\n",
    "            {'code': 'US001', 'cost': 120},\n",
    "    ]},\n",
    "    {'sku': 'hb01', 'name': 'Hub', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'rm01', 'name': 'Rim', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 600},\n",
    "            {'code': 'US001', 'cost': 510},\n",
    "    ]},\n",
    "    {'sku': 'ty01', 'name': 'Tire', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 568},\n",
    "            {'code': 'CN001', 'cost': 320},\n",
    "            {'code': 'US001', 'cost': 700},\n",
    "    ]},\n",
    "    {'sku': 'vlv01', 'name': 'Valve', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 42},\n",
    "            {'code': 'CN001', 'cost': 25},\n",
    "            {'code': 'US001', 'cost': 32},\n",
    "    ]},\n",
    "    {'sku': 'hbr01', 'name': 'Handlebar', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR002', 'cost': 234},\n",
    "    ]},\n",
    "    {'sku': 'hdg01', 'name': 'Handlebar grip', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 121},\n",
    "            {'code': 'FR002', 'cost': 234},\n",
    "            {'code': 'US001', 'cost': 210},\n",
    "    ]},\n",
    "    {'sku': 'fb01', 'name': 'Front brake', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 451},\n",
    "            {'code': 'US001', 'cost': 612},\n",
    "    ]},\n",
    "    {'sku': 'fo01', 'name': 'Fork', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 213},\n",
    "            {'code': 'FR001', 'cost': 250},\n",
    "            {'code': 'FR002', 'cost': 300},\n",
    "            {'code': 'US001', 'cost': 320},\n",
    "    ]},\n",
    "    {'sku': 'sh01', 'name': 'Shifter', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 221},\n",
    "            {'code': 'US001', 'cost': 240},\n",
    "    ]},\n",
    "    {'sku': 's01', 'name': 'Saddle', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 111},\n",
    "            {'code': 'UK001', 'cost': 125},\n",
    "    ]},\n",
    "    {'sku': 'sp02', 'name': 'Seat post', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 222},\n",
    "            {'code': 'US001', 'cost': 300},\n",
    "    ]},\n",
    "    {'sku': 'fd01', 'name': 'Front Derailleur', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'US001', 'cost': 451},\n",
    "    ]},\n",
    "    {'sku': 'ch01', 'name': 'Chain', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 234},\n",
    "    ]},\n",
    "    {'sku': 'cr01', 'name': 'Chain Rings', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'FR002', 'cost': 60},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'fr01', 'name': 'Frame', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 212},\n",
    "            {'code': 'FR001', 'cost': 250},\n",
    "            {'code': 'FR002', 'cost': 300},\n",
    "            {'code': 'US001', 'cost': 320},\n",
    "    ]},\n",
    "    {'sku': 'rb01', 'name': 'Rear brakes', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'cs01', 'name': 'Cog set', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 261},\n",
    "            {'code': 'US001', 'cost': 211},\n",
    "    ]},\n",
    "    {'sku': 'rd01', 'name': 'Rear Derailluer', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 340},\n",
    "            {'code': 'US001', 'cost': 432},\n",
    "    ]},\n",
    "    {'sku': 'pd01', 'name': 'Pedal', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'FR002', 'cost': 80},\n",
    "            {'code': 'US001', 'cost': 62},\n",
    "    ]},\n",
    "    {'sku': 'ca01', 'name': 'Crank Arm', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 60},\n",
    "            {'code': 'FR001', 'cost': 120},\n",
    "            {'code': 'US001', 'cost': 89},\n",
    "    ]},\n",
    "    {'sku': 'drk_grn', 'name': 'Green', 'uom': 'm2', 'suppliers': [\n",
    "            {'code': 'FR001', 'cost': 100},\n",
    "    ]},\n",
    "    {'sku': 'st01', 'name': 'Stem', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'FR001', 'cost': 400},\n",
    "    ]},\n",
    "    {'sku': 'hd01', 'name': 'Head', 'uom': 'pc', 'suppliers': [\n",
    "            {'code': 'CN001', 'cost': 500},\n",
    "            {'code': 'US001', 'cost': 550},\n",
    "    ]},\n",
    "]\n",
    "\n",
    "for part in parts:\n",
    "    sku = part['sku']\n",
    "    name = part['name']\n",
    "    uom = part['uom']\n",
    "    \n",
    "    query = f\"CREATE (:Part {{sku: '{sku}', name: '{name}', uom: '{uom}'}})\"\n",
    "    queries.append(query)\n",
    "    \n",
    "    # Part Description\n",
    "    query = f\"CREATE (:Description {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "    queries.append(query)\n",
    "    query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (p)-[:IS_DESCRIBED_BY]->(d)\"\n",
    "    queries.append(query)\n",
    "#     query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (d)-[:DESCRIBES]->(p)\"\n",
    "#     queries.append(query)\n",
    "\n",
    "    # Part Specification\n",
    "    query = f\"CREATE (:Specification {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "    queries.append(query)\n",
    "    query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (p)-[:IS_SPECIFIED_BY]->(d)\"\n",
    "    queries.append(query)\n",
    "#     query = f\"MATCH (p:Part {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (d)-[:SPECIFIES]->(p)\"\n",
    "#     queries.append(query)\n",
    "\n",
    "    counter = 0\n",
    "    for supplier in part['suppliers']:\n",
    "        supplier_code = supplier['code']\n",
    "        supplier_cost = supplier['cost']\n",
    "        \n",
    "\t# Supplier\n",
    "        part_supplier_query = f\"MATCH (p:Part {{sku: '{sku}'}}), (s:Supplier {{code: '{supplier_code}'}}) CREATE (p)-[:IS_SOURCED_FROM {{cost: {supplier_cost}}}]->(s)\"\n",
    "        queries.append(part_supplier_query)\n",
    "        # supplier_part_query = f\"MATCH (p:Part {{sku: '{sku}'}}), (s:Supplier {{code: '{supplier_code}'}}) CREATE (s)-[:SUPPLIES {{cost: {supplier_cost}}}]->(p)\"\n",
    "        # queries.append(supplier_part_query)\n",
    "\n",
    "\t# Selected Supplier / Winning Supplier / Contracted Supplier\n",
    "        if counter == 0:\n",
    "            selected_supplier_query = f\"MATCH (p:Part {{sku: '{sku}'}}), (s:Supplier {{code: '{supplier_code}'}}) CREATE (p)-[:SELECTED {{cost: {supplier_cost}}}]->(s)\"\n",
    "            queries.append(selected_supplier_query)\n",
    "\n",
    "        counter +=1\n",
    "        \n",
    "\n",
    "\n",
    "# Print the queries\n",
    "# for query in queries:\n",
    "#     print(query)\n",
    "    \n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "63ee6e95",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Product(s) and relationships\n",
    "queries = []\n",
    "\n",
    "products = [\n",
    "    {\n",
    "        \"sku\": \"ss01\",\n",
    "        \"name\": \"SuperSport\",\n",
    "        \"retail_price\": 29999,\n",
    "        \"assemblies\": [\n",
    "            {'sku': 'co01', 'name': 'Color', 'parts': [\n",
    "                {'sku':'drk_grn','qty':2, 'order': 1},\n",
    "                ]},\n",
    "            {'sku': 'whl01', 'name': 'Wheel Assembly', 'parts': [\n",
    "                {'sku':'sp01','qty':21, 'order': 2},\n",
    "                {'sku':'hb01','qty':1, 'order': 1},\n",
    "                {'sku':'rm01','qty':1, 'order': 3},\n",
    "                {'sku':'ty01','qty':1, 'order': 5},\n",
    "                {'sku':'vlv01','qty':1, 'order': 4},\n",
    "                ], 'assemblies': [\n",
    "                    {'sku': 'co01'}\n",
    "                ]},\n",
    "            {'sku': 'fs01', 'name': 'Front Set', 'parts': [\n",
    "                {'sku':'hbr01','qty':1, 'order': 1},\n",
    "                {'sku':'hdg01','qty':2, 'order': 2},\n",
    "                {'sku':'fb01','qty':1, 'order': 3},\n",
    "                {'sku':'fo01','qty':1, 'order': 5},\n",
    "                {'sku':'sh01','qty':1, 'order': 4},\n",
    "                ], 'assemblies': [\n",
    "                    {'sku': 'co01'}\n",
    "                ]},\n",
    "            {'sku': 'sa01', 'name': 'Saddle Area', 'parts': [\n",
    "                {'sku':'s01','qty':1, 'order': 2},\n",
    "                {'sku':'sp02','qty':1, 'order': 1},\n",
    "                ]},\n",
    "            {'sku': 'tr01', 'name': 'Transmission', 'parts': [\n",
    "                {'sku':'fd01','qty':21, 'order': 2},\n",
    "                {'sku':'ch01','qty':1, 'order': 1},\n",
    "                {'sku':'cr01','qty':1, 'order': 3},\n",
    "                {'sku':'rb01','qty':1, 'order': 4},\n",
    "                {'sku':'cs01','qty':1, 'order': 5},\n",
    "                {'sku':'rd01','qty':1, 'order': 6},\n",
    "                {'sku':'rca01','qty':2, 'order': 7},\n",
    "                {'sku':'pd01','qty':2, 'order': 8},\n",
    "                ]},\n",
    "            {'sku': 'fr01', 'name': 'Frame', 'parts': [\n",
    "                {'sku':'fr01','qty':1, 'order': 1},\n",
    "                {'sku':'st01','qty':1, 'order': 2},\n",
    "                {'sku':'hd01','qty':1, 'order': 3},\n",
    "                ], 'assemblies': [\n",
    "                    {'sku': 'co01'}\n",
    "                ]},\n",
    "        ],\n",
    "    }\n",
    "]\n",
    "\n",
    "for product in products:\n",
    "    sku = product['sku']\n",
    "    name = product['name']\n",
    "    retail_price = product['retail_price']\n",
    "\n",
    "    # Create Product\n",
    "    product_query = f\"CREATE (:Product {{sku: '{sku}', name: '{name}', retail_price: {retail_price}}})\"\n",
    "    queries.append(product_query)\n",
    "    \n",
    "    # Product Description\n",
    "    query = f\"CREATE (:Description {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "    queries.append(query)\n",
    "    query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (p)-[:IS_DESCRIBED_BY]->(d)\"\n",
    "    queries.append(query)\n",
    "    # query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Description {{sku: '{sku}'}}) CREATE (d)-[:DESCRIBES]->(p)\"\n",
    "    # queries.append(query)\n",
    "\n",
    "    # Product Specification\n",
    "    query = f\"CREATE (:Specification {{sku: '{sku}', body: '{lorem.sentence()}', version: 'latest'}})\"\n",
    "    queries.append(query)\n",
    "    query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (p)-[:IS_SPECIFIED_BY]->(d)\"\n",
    "    queries.append(query)\n",
    "    # query = f\"MATCH (p:Product {{sku: '{sku}'}}), (d:Specification {{sku: '{sku}'}}) CREATE (d)-[:SPECIFIES]->(p)\"\n",
    "    # queries.append(query)\n",
    "    \n",
    "    for assembly in product['assemblies']:\n",
    "        assembly_sku = assembly['sku']\n",
    "        assembly_name = assembly['name']\n",
    "        \n",
    "        assembly_query = f\"CREATE (:Assembly {{sku: '{assembly_sku}', name: '{assembly_name}'}})\"\n",
    "        queries.append(assembly_query)\n",
    "        \n",
    "        # Product Assembly\n",
    "        # assembly_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Product {{sku: '{sku}'}}) CREATE (a)-[:BELONGS_TO {{qty: {qty}, order: {order}}}]->(p)\"\n",
    "        # queries.append(assembly_part_query)\n",
    "        part_assembly_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Product {{sku: '{sku}'}}) CREATE (p)-[:HAS {{qty: {qty}, order: {order}}}]->(a)\"\n",
    "        queries.append(part_assembly_query)\n",
    "        \n",
    "        if 'parts' in assembly:\n",
    "            for part in assembly['parts']:\n",
    "                part_sku = part['sku']\n",
    "                qty = part['qty']\n",
    "                order = part['order']\n",
    "                \n",
    "                # Part Assembly\n",
    "                assembly_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Part {{sku: '{part_sku}'}}) CREATE (a)-[:HAS {{qty: {qty}, order: {order}}}]->(p)\"\n",
    "                queries.append(assembly_part_query)\n",
    "                # part_assembly_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (p:Part {{sku: '{part_sku}'}}) CREATE (p)-[:BELONGS_TO {{qty: {qty}, order: {order}}}]->(a)\"\n",
    "                # queries.append(part_assembly_query)\n",
    "                \n",
    "        if 'assemblies' in assembly:\n",
    "            for a in assembly['assemblies']:\n",
    "                a_sku = a['sku']\n",
    "                        \n",
    "                assembly_part_query = f\"MATCH (a:Assembly {{sku: '{assembly_sku}'}}), (b:Assembly {{sku: '{a_sku}'}}) CREATE (a)-[:HAS]->(b)\"\n",
    "                queries.append(assembly_part_query)\n",
    "\n",
    "\n",
    "\n",
    "# # Print the queries\n",
    "# for query in queries:\n",
    "#     print(query)\n",
    "\n",
    "# Execute Queries\n",
    "for query in queries:\n",
    "    records, summary, keys = driver.execute_query(\n",
    "    query,\n",
    "    database_=\"neo4j\",\n",
    ")\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "0ce57126-cf4d-4286-bca7-d5328d73f9fb",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "records, summary, keys = driver.execute_query(\n",
    "    \"MATCH p=()-[]->() RETURN p;\",\n",
    "    database_=\"neo4j\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7db44ae2-46c7-4075-bfa6-ef3eb1e55e46",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Summary information\n",
    "print(\"The query `{query}` returned {records_count} records in {time} ms.\".format(\n",
    "    query=summary.query, records_count=len(records),\n",
    "    time=summary.result_available_after,\n",
    "))\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for node in records:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f91f252d-0b83-416b-aae8-8205980c47d0",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.graph.Graph at 0x149b6ae10>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "  graph = session.run(\"MATCH p=()-[]->() RETURN p;\").graph()\n",
    "\n",
    "graph\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "1585483e-33f0-4eb5-8867-a61db6f8728c",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "91f6646ad8054f05a7e0ae9da692da6e",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='500px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "def custom_node_color_mapping(index: int, node: dict):\n",
    "    # print(node)\n",
    "    if node[\"properties\"][\"label\"] == \"Part\":\n",
    "        return \"green\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Product\":\n",
    "        return \"red\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Assembly\":\n",
    "        return \"orange\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Specification\":\n",
    "        return \"blue\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Description\":\n",
    "        return \"cyan\"\n",
    "    elif node[\"properties\"][\"label\"] == \"Supplier\":\n",
    "        return \"pink\"\n",
    "    \n",
    "def custom_node_label_mapping(index: int, node: dict):\n",
    "    # print(node)\n",
    "    if node[\"properties\"][\"label\"] == \"Part\":\n",
    "        return node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Product\":\n",
    "        return node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Assembly\":\n",
    "        return node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Specification\":\n",
    "        return \"v: \" + node[\"properties\"][\"version\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Description\":\n",
    "        return \"v: \" + node[\"properties\"][\"version\"]\n",
    "    elif node[\"properties\"][\"label\"] == \"Supplier\":\n",
    "        return node[\"properties\"][\"name\"] + \" - \" + node[\"properties\"][\"country\"]\n",
    "    \n",
    "\n",
    "from yfiles_jupyter_graphs import GraphWidget\n",
    "w = GraphWidget(graph=graph)\n",
    "w.directed = False\n",
    "w.set_graph_layout(\"orthogonal\")\n",
    "w.set_neighborhood(1,[graph.nodes.get(0).element_id])\n",
    "w.set_sidebar(enabled = False, start_with = \"Neighbourhood\")\n",
    "w.set_overview(False)\n",
    "\n",
    "w.set_node_color_mapping(custom_node_color_mapping)\n",
    "# w.set_node_color_mapping(lambda index, node : \"blue\" if node[\"properties\"][\"label\"] == \"Part\" else (\"orange\" if node[\"properties\"][\"label\"] == \"SubAssembly\" else \"red\"))\n",
    "w.set_edge_color_mapping(lambda index, edge : \"orange\")\n",
    "# w.set_node_label_mapping(lambda index, node : node[\"properties\"][\"sku\"] + \" - \" + node[\"properties\"][\"name\"])\n",
    "w.set_node_label_mapping(custom_node_label_mapping)\n",
    "# w.set_node_scale_factor_mapping(lambda index,node: node[\"properties\"][\"cost\"] / 1000 if node[\"properties\"][\"label\"] == \"Part\" else 1)\n",
    "\n",
    "w.show()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
